import numpy as np

array = np.array([[1,2,3], 
                 [4,5,6], 
                 [7,8,9], 
                 [10,11,12]])
#print(array[1]) # هاذا راح يطبع اللسته الثانية
#print(array[1:3]) # هاذا راح يطبع من الثانيه لي الاخيره
#print(array[1:]) # هاذا راح يطبع من الثانية لي اخر شي
# اذا حطيت سالب واحد )(1- راح يبداء من اخر شي)
#print(array[0::2]) # راح يطبع اللسته الزوجيه
#print(array[:, 0]) # بعد ما تحط علامة ال, بعدها راح تختار الي داخل اللسته
#print(array[0:, 0:2]) مثال ثاني على انك تاخذ الي داخل اللسته
# 